<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<details open><summary>Diff of 9 changes.</summary>

```diff
# tailscale_tailnet_key.tailscale_key has been deleted
# module.vm_minimal_config.proxmox_virtual_environment_vm.vm has been deleted
+ tailscale_tailnet_key.tailscale_key will be created
! module.debian13.proxmox_virtual_environment_vm.vm_template will be updated in-place
! module.ubuntu22.proxmox_virtual_environment_vm.vm_template will be updated in-place
+ module.ubuntu22.terraform_data.combined_ci_hash will be created
+ module.vm_minimal_config.proxmox_virtual_environment_vm.vm will be created
+ module.debian13.module.cloud_init_files.random_id.random_id will be created
+ module.ubuntu22.module.cloud_init_files.random_id.random_id will be created
+ module.vm_minimal_config.module.cloud_init_files.proxmox_virtual_environment_file.ci_user_data[0] will be created
+ module.vm_minimal_config.module.cloud_init_files.random_id.random_id will be created
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 7 to add, 2 to change, 0 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-08-11T02:29:37Z [(view log)](https://github.com/perchnet/p/actions/runs/16869521786/job/47781677160#step:11:1).
</summary>

```hcl

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # tailscale_tailnet_key.tailscale_key has been deleted
  - resource "tailscale_tailnet_key" "tailscale_key" {
        id            = "kBDMDtJi8y11CNTRL"
      - key           = (sensitive value) -> null
        tags          = [
            "tag:web-ingress",
        ]
        # (9 unchanged attributes hidden)
    }

  # module.vm_minimal_config.proxmox_virtual_environment_vm.vm has been deleted
  - resource "proxmox_virtual_environment_vm" "vm" {
      - id                      = "10000" -> null
      - ipv4_addresses          = [] -> null
      - ipv6_addresses          = [] -> null
        name                    = "vm-ubuntu22-minimal"
        # (26 unchanged attributes hidden)

        # (9 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # tailscale_tailnet_key.tailscale_key will be created
  + resource "tailscale_tailnet_key" "tailscale_key" {
      + created_at    = (known after apply)
      + ephemeral     = false
      + expires_at    = (known after apply)
      + expiry        = 600
      + id            = (known after apply)
      + invalid       = (known after apply)
      + key           = (sensitive value)
      + preauthorized = true
      + reusable      = true
      + tags          = [
          + "tag:web-ingress",
        ]
      + user_id       = (known after apply)
    }

  # module.debian13.proxmox_virtual_environment_vm.vm_template will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm_template" {
      ~ description             = "Terraform generated template on 2025-08-11T02:22:22Z" -> (known after apply)
        id                      = "9013"
        name                    = "debian13"
        tags                    = [
            "debian",
            "template",
            "terraform",
        ]
        # (28 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.ubuntu22.proxmox_virtual_environment_vm.vm_template will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm_template" {
      ~ description             = "Terraform generated template on 2025-08-11T02:22:22Z" -> (known after apply)
        id                      = "8022"
        name                    = "ubuntu22"
        tags                    = [
            "template",
            "terraform",
            "ubuntu",
        ]
        # (28 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.ubuntu22.terraform_data.combined_ci_hash will be created
  + resource "terraform_data" "combined_ci_hash" {
      + id     = (known after apply)
      + input  = {
          + hash = 0
        }
      + output = (known after apply)
    }

  # module.vm_minimal_config.proxmox_virtual_environment_vm.vm will be created
  + resource "proxmox_virtual_environment_vm" "vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + machine                 = "q35"
      + migrate                 = false
      + name                    = "vm-ubuntu22-minimal"
      + network_interface_names = (known after apply)
      + node_name               = "pve1"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-single"
      + started                 = true
      + stop_on_destroy         = false
      + tablet_device           = false
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = (known after apply)

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + clone {
          + full    = true
          + retries = 1
          + vm_id   = 8022
        }

      + cpu {
          + cores      = 1
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "host"
          + units      = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "writeback"
          + datastore_id      = "zssd"
          + discard           = "on"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 8
          + ssd               = true
        }

      + initialization {
          + datastore_id         = "zssd"
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)

          + dns {
              + servers = []
            }

          + ip_config {
              + ipv4 {
                  + address = "dhcp"
                }
            }

          + user_account {
              + keys = [
                  + "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAILUTdPEpjE/Hjbn9jNITSAYkYWTgtTLcXW8QyfTOu2Fq",
                ]
            }
        }

      + memory {
          + dedicated      = 1024
          + floating       = 1024
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + vga {
          + memory = 16
          + type   = "std"
        }
    }

  # module.debian13.module.cloud_init_files.random_id.random_id will be created
  + resource "random_id" "random_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "combined_ci_hash"                    = "9af15b"
          + "short_ci_meta_data_contents_hash"    = "0"
          + "short_ci_network_data_contents_hash" = "0"
          + "short_ci_user_data_contents_hash"    = "0"
          + "short_ci_vendor_data_contents_hash"  = "0"
        }
    }

  # module.ubuntu22.module.cloud_init_files.random_id.random_id will be created
  + resource "random_id" "random_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "combined_ci_hash"                    = "9af15b"
          + "short_ci_meta_data_contents_hash"    = "0"
          + "short_ci_network_data_contents_hash" = "0"
          + "short_ci_user_data_contents_hash"    = "0"
          + "short_ci_vendor_data_contents_hash"  = "0"
        }
    }

  # module.vm_minimal_config.module.cloud_init_files.proxmox_virtual_environment_file.ci_user_data[0] will be created
  + resource "proxmox_virtual_environment_file" "ci_user_data" {
      + content_type           = "snippets"
      + datastore_id           = "snippets"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "pve1"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_raw {
          + data      = (sensitive value)
          + file_name = (known after apply)
          + resize    = 0
        }
    }

  # module.vm_minimal_config.module.cloud_init_files.random_id.random_id will be created
  + resource "random_id" "random_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "combined_ci_hash"                    = (known after apply)
          + "short_ci_meta_data_contents_hash"    = "0"
          + "short_ci_network_data_contents_hash" = "0"
          + "short_ci_user_data_contents_hash"    = (known after apply)
          + "short_ci_vendor_data_contents_hash"  = "0"
        }
    }

Plan: 7 to add, 2 to change, 0 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-43-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->